{{-- Layout and design by WhileD0S <https://vk.com/whiled0s>  --}}
@extends('layouts.shop')

@section('title')
    Основные сведения по работе с системой
@endsection

@section('content')
    <div id="content-container">
        <div class="z-depth-1 content-header text-center">
            <h1><i class="fa fa-info fa-left-big"></i>Основные сведения по работе с системой</h1>
        </div>
        <div class="card card-block">
            <h3 class="card-title">Предметы и товары</h3>
            <p class="card-text">
                <p>
                    Вы, наверное, уже заметили то, что в L-Shop присутствует такая терминология, как <strong>предмет</strong>
                    и <strong>товар</strong>. По началу, вам может показаться бессмысленным такое деление, но позже вы
                    поймете, что это очень удобно. Приведу пример.
                </p>
                <p>
                    Представьте, что у вас есть 2 сервера Vanilla и Hi-Tech. Вы захотели продавать на обоих серверах алмазы.
                    Но, как правило, алмазы на ванильном сервере являются более ценным ресурсом, нежели на высокотехнологичном
                    сервере. Следовательно, для разных серверов нужно указывать разную цену. И вот, вы создаете предмет
                    "Алмаз", загружаете ему красивую картинку, указываете ID 264. А затем, попросту, создаете 2
                    товара: 1 для Vanila, а другой - для Hi-Tech сервера, ествесственно, указывая им разную цену, а может,
                    и количество. Таким образом у вас есть 1 предмет, который вы можете привязывать к разным товарам.
                    И это действительно удобно! Если бы система состояла только из товаров, то вам бы пришлось дублировать данные
                    алмаза для каждого сервера.
                </p>
            </p>
        </div>
    </div>
@endsection
