<?php

return [
    'admin' => [
        'products' => [
            'add' => [
                'products_in_stack' => 'Количество товара в 1 стаке',
                'perm_duration' => 'Длительность привилегии (В днях). 0 - навсегда',
                'products_price' => 'Цена за стак товара',
                'perm_price' => 'Цена одного периода привилегии',
            ]
        ],
        'items' => [
            'add' => [
                'item_name' => 'Название предмета',
                'perm_name' => 'Название привилегии',
                'item_id' => 'ID или ID:DATA предмета',
                'perm_id' => 'Внутриигровой идентификатор привилегии',
            ]
        ],
        'users' => [
            'list' => [
                'search' => [
                    'placeholder' => 'Искать пользователей',
                    'lets_typing' => 'Начните вводить...',
                    'nothing' => 'Ничего не найдено',
                    'wait' => 'Поиск...'
                ]
            ]
        ]
    ],
    'shop' => [
        'cart' => [
            'empty' => 'Корзина пуста'
        ],
        'news' => [
            'read_more' => 'Подробнее...'
        ]
    ]
];
