<?php

return [
    'admin' => [
        'save' => 'Сохранить изменения',

        'control' => [
            'main_settings' => [
                'title' => 'Основные настройки',
                'shop' => [
                    'title' => 'Магазин',
                    'edit_info' => 'Редактировать основную информацию о магазине.',
                    'name' => 'Имя магазна',
                    'name_popover' => 'Имя магазина будет отображаться на главной страницы а также в заголовках страниц.',
                    'description' => 'Описание магазина',
                    'description_popover' => 'Описание магазина используется в основном поисковыми системами для индексации ресурса.',
                    'keywords' => 'Ключевые слова',
                    'keywords_popover' => 'Ключевые слова используются в основном поисковыми системами для индексации ресурса. Их нужно перечислять через запятую без пробелов.',

                    'sort_attr' => 'Сортировать товары по:',
                    'sort_attr_name' => 'Названию предмета (А -> Я)',
                    'sort_attr_name_desc' => 'Названию предмета (Я -> А)',
                    'sort_attr_sort_priority' => 'Приоритету сортировки товара (1 -> N)',
                    'sort_attr_sort_priority_desc' => 'Приоритету сортировки товара (N -> 1)',

                ],
                'access_mode' => [
                    'title' => 'Режим доступа',
                    'description' => 'Этот параметр регулирует то, каким образом пользователи смогут получать доступ к магазину.<br>
                        <strong>Только гости</strong>: авторизация в магазине отключена, пользователи будут приобретать товары без входа в аккаунт.<br>
                        <strong>Только авторизованные пользователи</strong>: авторизация в магазине является обязательной, товары могут преобретать
                        только пользователи, вошедшие в свой аккаунт.<br>
                            <strong>И гости и авторизованные пользователи</strong>: Пользователи могут совершать покупки как войдя в аккаунт, так и
                        без входа в него.',
                    'guest' => 'Только гости',
                    'auth' => 'Только авторизованные пользователи',
                    'all' => 'И гости и авторизованные пользователи',
                ],
                'register' => [
                    'title' => 'Регистрация',
                    'enable' => 'Разрешить регистрацию новых пользователей',
                    'send_mail' => 'Включить отправку писем на почту пользователям для подтверждения аккаунта',
                    'send_mail_popover' => 'Если опция включена, то после регистрации пользователю будет отправляться письмо на указанный им email. Это необходимо, дабы подтвердить валидность адреса электронной почты.',
                    'redirect' => 'Перенаправлять пользователя на кастомный URL после регистрации',
                    'redirect_popover' => 'Если опция включена, то после регистрации пользователь будет перенаправлен на URL, который указан в поле ниже.',
                    'url' => 'Кастомный URL',
                ],
                'skins' => [
                    'title' => 'Скины и плащи',
                    'enable' => 'Разрешить пользователям устанавливать скины',
                    'enable_popover' => 'Игроки смогут устанавливать <strong>скины</strong> для своих персонажей. Если отключена возможность установки HD скинов, то размер скина должен быть равен <strong>64x32</strong> пикселя.',
                    'hd' => 'Разрешить пользователям устанавливать HD скины',
                    'hd_popover' => 'Игроки смогут устанавливать <strong>HD скины</strong> для воих персонажей. Максимадьный размер изображения - <strong>1024x512</strong>.',
                    'size' => 'Максимальный размер файла скина',
                    'size_popover' => 'Размер следует указывать в <strong>килобайтах</strong>.',
                ],
                'cloaks' => [
                    'enable' => 'Разрешить пользователям устанавливать плащи',
                    'enable_popover' => 'Игроки смогут устанавливать <strong>плащи</strong> для своих персонажей. Если отключена возможность установки HD плащей, то размер скина должен быть равен <strong>22x17</strong> пикселя.',
                    'hd' => 'Разрешить пользователям устанавливать HD плащи',
                    'hd_popover' => 'Игроки смогут устанавливать <strong>HD плащи</strong> для cвоих персонажей. Максимальный размер изображения - <strong>1024x512</strong>.',
                    'size' => 'Максимальный размер файла плащи',
                    'size_popover' => 'Размер следует указывать в <strong>килобайтах</strong>.',
                ],
                'news' => [
                    'title' => 'Новости',
                    'enable' => 'Включить показ новостей',
                    'first_portion' => 'Количество новостей, находящихся на экране при загрузке',
                    'load_portion' => 'Количество подгружаемых за раз новостей'
                ],
                'pagination' => [
                    'title' => 'Пагинация',
                    'shop_products_per_page' => 'Количество товаров на 1 странице магазина',
                    'profile_payments_per_page' => 'Количество элементов на 1 странице истории платежей в профиле пользователя',
                    'profile_in_game_cart_per_page' => 'Количество элементов на 1 странице внутриигровой корзины в профиле пользователя',
                ],
                'cart' => [
                    'title' => 'Корзина',
                    'capacity' => 'Максимальная вместимость корзины'
                ],
                'monitoring' => [
                    'title' => 'Мониторинг',
                    'enable' => 'Включить мониторинг серверов',
                    'timeout' => 'Таймаут соединения',
                    'timeout_popover' => 'Время, после которого произойдет автоматическое отключение соединения с сокетом сервера. (Если не произошло соединение). Указывать следует в секундах.',
                    'pattern' => 'Формат ответа',
                    'pattern_popover' => 'Сюда следует ввести регулярное выражение, по которому будет производится разбор строки ответа. Оно в обязательном порядке должно включать в себя capture-group ?&lt;now&gt; (Для маркировки текущего онлайна) и ?&lt;total&gt; (Для маркировки общего количества слотов на сервере). Учтите, что перед тем как сравниваться с регулярным выражением строка ответа от сервера очищается от спецсимволов.',
                ],
                'maintenance' => [
                    'title' => 'Режим обслуживания',
                    'description' => 'Включить / отключить режим обслуживания. Этот режим закрывает доступ к сайту.
                    Доступ будет открыт только для администраторов. Также будет доступна страница авторизации
                    (Список доступных маршрутов вы можете изменить в свойстве <code>except</code>
                    посредника <code>App\Http\Middleware\CheckForMaintenanceMode</code>).
                    При этом, всем, кто вошел на сайт, будет показано какое либо сообщение. Изменить его вы
                    можете в файле <code>resources/view/errors/503.blade.php</code>.',
                    'enable' => 'Включить режим обслуживания'
                ]
            ],
            'payments' => [
                'title' => 'Платежи',
                'common' => [
                    'title' => 'Общее',
                    'min_sum' => 'Минимальная сумма пополнения баланса',
                    'currency' => 'Валюта',
                    'currency_name' => 'Название валюты',
                    'currency_html' => 'HTML представление валюты',
                ],
                'aggregators' => [
                    'title' => 'Платежные агрегаторы',
                    'robokassa' => [
                        'title' => 'Robokassa',
                        'enabled' => 'Использовать Robokassa',
                        'change_data' => 'Изменение персональных данных сервиса Robokassa',
                        'login' => 'Логин',
                        'password1' => 'Пароль №1',
                        'password2' => 'Пароль №2',
                        'algo' => 'Алгоритм расчета контрольной суммы:',
                        'is_test' => 'Тестовый режим',
                    ],
                    'interkassa' => [
                        'title' => 'Interkassa',
                        'enabled' => 'Использовать Interkassa',
                        'change_data' => 'Изменение персональных данных сервиса Interkassa',
                        'login' => 'Идентификатор кассы',
                        'key' => 'Ключ',
                        'currency' => 'Валюта',
                        'test_key' => 'Тестовый ключ',
                        'algo' => 'Алгоритм расчета контрольной суммы:',
                        'is_test' => 'Тестовый режим',
                    ],
                ]
            ],
            'api' => [
                'title' => 'API',
                'api_enable_alert' => 'Не забудьте включить API, перед началом его использования.',
                'api_doc_alert' => 'Подробную документацию по API вы можете найти',
                'api_doc_alert_btn' => 'тут',
                'enable_api' => [
                    'title' => 'Включить API',
                    'enable' => 'Включить',
                ],
                'key' => [
                    'title' => 'Ключ доступа',
                    'description' => 'С помощью данного ключа будут происходить все взаимодействия вашего ресурса с API l-shop. Длина ключа не должна быть меньше 32 символов.',
                    'secret_key' => 'Секретный ключ',
                    'alert' => 'Никогда и никому не сообщайте этот ключ! В противном случае, безопасность приложения будет под угрозой.',
                ],
                'algo' => [
                    'title' => 'Алгоритм хэширования',
                    'description' => 'При помощи этого алгоритма будет высчитываться контрольная сумма строки. Это необходимо для выполнения безопасного запроса к API.',
                    'alert' => 'Мы <strong>не рекомендуем</strong> использовать алгоритм <strong>md5</strong>, в силу его низкой устойчивости к перебору.'
                ],
                'separator' => [
                    'title' => 'Разделитель аргументов',
                    'description' => 'Этот символ будет разделять параметры в строке, из которой будет расчитываться контрольная сумма.',
                    'input' => 'Разделитель',
                ],
                'auth' => [
                    'title' => 'API - авторизация',
                    'enable' => 'Включить',
                    'remember' => 'Запоминать аутентифицированных пользователей'
                ],
                'register' => [
                    'title' => 'API - регистрация',
                    'enable' => 'Включить',
                ],
                'sashok' => [
                    'title' => 'Интеграция с Sashok724\'s Launcher',
                    'enable' => 'Включить',
                    'success_response' => [
                        'title' => 'Формат успешного ответа сервиса',
                        'description' => 'Данная строка будет "выведена" лаунчсерверу при успешной проверке введенных данных.
                            Маркер {username} будет заменен на имя пользователя. Например, если формат ответа OK:{username}, при успешной
                            проверке данных пользователя D3lph1, сервер получит ответ: OK:D3lph1.',
                        'format' => 'Формат'
                    ],
                    'fail_response' => [
                        'input' => 'Сообщение при неверном вводе данных пользователем'
                    ],
                    'whitelist' => [
                        'description' => 'Ниже вы можете ввести список ip-адресов, которые могут соединяться с L-Shop и проверять данные пользователей для авторизации в лаунчере.
                            Мы рекомендуем указать здесь ip вашего лаунчсервера. Оставьте поле пустым, дабы не использовать блокировку посторонних адресов (Не рекомендуется).',
                        'input' => 'Список разрешенных IP адресов (Разделитель - запятая. Например: 127.0.0.1, 192.168.0.1).'
                    ]
                ]
            ],
            'security' => [
                'title' => 'Безопасность',
                'debug_mode_alert' => '<p><strong>Внимание!</strong> У вас включен режим отладки. Посетители вашего сайта могут видеть отладочную
                    информацию, а также, ошибки. В обязательном порядке отключите этот режим в "продакшене", выставив значение
                    элемента <code>APP_DEBUG</code> в файле <code>.env</code> в значение <code>false</code>.</p>
                    Чтобы получилось так: <code>APP_DEBUG=false</code>',
                'generator' => [
                    'title' => 'Генератор ключей',
                    'description_app_key' => 'Этот инструмент поможет создать ключ приложения:',
                    'description_app_key_instruction' => '<p>Установите этот ключ значением элемента <code>APP_KEY</code> в файле <code>.env</code></p>
                        Должно получиться так: <code>APP_KEY={{ $key }}</code>',
                    'description_app_key_notify' => '<strong>Внимание!</strong> После изменения ключа приложения все пользователи (в том числе и вы) будут разлогинены.',
                    'description_app_auth_key' => 'А этот - ключ сессии:',
                    'description_app_auth_key_instruction' => '<p>Установите этот ключ значением элемента <code>APP_AUTH_KEY</code> в файле <code>.env</code></p>
                        Должно получиться так: <code>APP_AUTH_KEY={{ $key }}</code>',
                    'description_app_auth_key_notify' => 'Никогда и никому не сообщайте эти ключи! В противном случае, безопасность приложения будет под угрозой.',
                ],
                'recaptcha' => [
                    'title' => 'reCAPTCHA',
                    'description' => 'Изменение ключей сервиса reCAPTCHA.',
                    'public_key' => 'Публичный ключ',
                    'secret_key' => 'Секретный ключ',
                    'check' => 'Проверить',

                    'modal' => [
                        'title' => 'Проверка ReCAPTCHA',
                        'btn' => 'Понятно',
                    ]
                ],
                'user' => [
                    'title' => 'Пользователь',
                    'allow_change_password' => 'Разрешить пользователю менять пароль от своего аккаунта',
                    'allow_reset_password' => 'Разрешить пользователю "сбрасывать" пароль',
                ]
            ],
            'optimization' => [
                'title' => 'Оптимизация',
                'caching' => [
                    'title' => 'Кеширование',
                    'statistic_ttl' => 'Время существования кэша статистики (минут)',
                    'statistic_ttl_popover' => 'По истечении этого времени кэш статистики магазина будет удален, а затем обновлен.',
                    'pages_ttl' => 'Время существования кэша статических страниц (минут)',
                    'pages_ttl_popover' => 'По истечении этого времени кэш статических страниц будет удален, а затем обновлен.',
                    'news_ttl' => 'Время существования кэша новостей (минут)',
                    'news_ttl_popover' => 'По истечении этого времени кэш новостей будет удален, а затем обновлен.',
                    'monitoring_ttl' => 'Время существования кэша мониторинга серверов (минут)',
                    'monitoring_ttl_popover' => 'По истечении этого времени кэш мониторинга серверов будет удален, а затем обновлен.',

                    'routes_cache' => [
                        'title' => 'Обновить кэш маршрутов',
                        'description' => 'Описание маршрутов, по которым система определяет какой действие ассоциировать с тем или иным url\'ом
                            разбросаны по файлам и представлены в удобочитаемом для человека формате. Обновление кэша маршрутов
                            позволяет сгенерировать файл, в котором будут храниться маршруты в "удобном" для системы виде и, тем
                            самым, ускорить выполнение запросов.',
                    ],
                    'config_cache' => [
                        'title' => 'Обновить кэш конфигурации',
                        'description' => 'Для повышения скорости работы, Laravel кэширует настройки. После нажатия на кнопку ниже, кэш будет удален,
                            а затем сгенерирован снова. Это функция может быть полезна, если вы изменили значения каких-либо
                            настроек в файлах конфигурации.',
                    ],
                    'templates_cache' => [
                        'title' => 'Очистить кэш шаблонизатора',
                        'description' => 'Фреймворк, на котором базируется L-Shop, для удобства разработки, использует шаблонизатор Blade.
                            Blade кэширует представления для того, чтобы увеличить скорость работы. Вам может понадобиться очистить
                            этот кэш. Он будет воссоздан после обновления каждой страницы сайта.',
                    ],
                    'app_cache' => [
                        'title' => 'Очистить кэш приложения',
                        'description' => 'Для достижения наилучшей производительности, L-Shop кеширует многие данные, дабы "доставать" их из
                            кеша, а не "тащить" из базы данных. Кнопка ниже поможет очистить всю эту информацию. Она будет воссоздана
                            автоматически, когда это потребуется.',
                    ]
                ],
            ]
        ],
        'servers' => [
            'add' => [
                'title' => 'Добавить сервер',
                'name' => 'Имя сервера',
                'categories' => [
                    'title' => 'Категории',
                    'name' => 'Имя категории',
                    'add' => 'Добавить категорию'
                ],
                'ip' => 'IP-адрес сервера',
                'port' => 'RCON-порт сервера',
                'password' => 'RCON пароль',
                'monitoring' => 'Включить мониторинг сервера',
                'enable' => 'Включить сервер',
                'save' => 'Сохранить'
            ],
            'edit' => [
                'title' => 'Редактировать сервер :name',
                'new_category_name' => 'Имя новой категории',
                'add' => 'Добавить категорию',
                'remove' => 'Удалить сервер'
            ],
            'list' => [
                'title' => 'Редактировать серверы',
                'create' => 'Создать сервер',
                'edit' => 'Редактировать',
                'enable' => 'Включить',
                'disable' => 'Выключить',
            ]
        ],
        'products' => [
            'add' => [
                'title' => 'Добавить товар',
                'attach_item' => 'Привязать предмет/привилегию:',
                'products_in_stack' => 'Количество товара в 1 стаке',
                'perm_duration' => 'Длительность привилегии (В днях). 0 - навсегда',
                'products_price' => 'Цена за стак товара',
                'perm_price' => 'Цена одного периода привилегии',
                'sort_priority' => 'Приоритет сортировки',
                'sort_priority_popover' => 'Приоритет сортировки - это дробное или целое, положительное или отрицательное число. По этому значению будет происходить сортировка товаров в каталоге (Этот режим можно включить/отключить в <strong>Управление > Основные настройки</strong>).',
                'attach_server_category' => 'Привязать к серверу/категории:',
                'save' => 'Сохранить'
            ],
            'edit' => [
                'title' => 'Редактировать товар',
                'remove' => 'Удалить товар'
            ],
            'list' => [
                'title' => 'Редактировать товары',
                'add' => 'Добавить товар',
                'sort' => [
                    'title' => 'Сортировать',
                    'without' => 'Без сортировки',
                    'id' => 'По идентификатору',
                    'id_desc' => 'По идентификатору, в обратном порядке',
                    'name' => 'По названию',
                    'name_desc' => 'По названию, в обратном порядке'
                ],
                'filter' => [
                    'title' => 'Фильтр',
                    'without' => 'Без фильтра'
                ],
                'table' => [
                    'id' => 'ID',
                    'image' => 'Изображение предмета',
                    'name' => 'Название предмета',
                    'price' => 'Цена (за стак)',
                    'count' => 'Количество / длительность',
                    'server' => 'Сервер',
                    'category' => 'Категория',
                    'edit' => 'Редактировать'
                ],
                'empty' => 'Список товаров пуст...'
            ]
        ],
        'items' => [
            'add' => [
                'title' => 'Добавить предмет',
                'item_name' => 'Название предмета',
                'perm_name' => 'Название привилегии',
                'type' => [
                    'title' => 'Тип:',
                    'item' => 'Предмет/блок',
                    'perm' => 'Привилегия',
                ],
                'image' => [
                    'title' => 'Тип изображения:',
                    'default' => 'Стандартное изображение',
                    'load' => 'Загрузить изображение',
                    'select' => 'Выбрать изображение',
                    'not_selected' => 'Изображение не выбрано'
                ],
                'item_id' => 'ID или ID:DATA предмета',
                'perm_id' => 'Внутриигровой идентификатор привилегии',
                'extra' => 'Extra'
            ],
            'edit' => [
                'title' => 'Редактировать предмет',
                'image' => [
                    'current' => 'Текущее'
                ],
                'remove' => 'Удалить предмет'
            ],
            'list' => [
                'title' => 'Редактировать предметы',
                'add' => 'Добавить предмет',
                'table' => [
                    'id' => 'ID',
                    'image' => 'Изображение',
                    'name' => 'Название',
                    'type' => 'Тип',
                    'extra' => 'Extra',
                    'edit' => 'Редактировать',
                ],
                'empty' => 'Список предметов пока пуст...'
            ]
        ],
        'news' => [
            'add' => [
                'title' => 'Добавить новость',
                'name' => 'Заголовок новости',
                'placeholder' => 'Начните придумывать что-то невероятное...',
                'publish' => 'Опубликовать',
            ],
            'edit' => [
                'title' => 'Редактировать новость',
                'remove' => 'Удалить новость'
            ],
            'list' => [
                'title' => 'Редактировать новости',
                'add' => 'Добавить новость',
                'table' => [
                    'id' => 'ID',
                    'name' => 'Заголовок',
                    'author' => 'Автор',
                    'published_at' => 'Дата публикации',
                    'updated_at' => 'Дата последнего редактирования',
                    'edit' => 'Редактировать'
                ],
                'empty' => 'Новостей пока нет...'
            ]
        ],
        'pages' => [
            'add' => [
                'title' => 'Добавить статическую страницу',
                'name' => 'Заголовок страницы',
                'placeholder' => 'Начните придумывать что-то невероятное...',
                'generate' => 'Сгенерировать автоматически',
                'address' => 'Адрес страницы',
                'access' => 'Вы сможете получить доступ к странице, перейдя по ссылке: <strong>:url</strong>',
                'save' => 'Сохранить страницу',
            ],
            'edit' => [
                'title' => 'Редактировать статическую страницу',
                'remove' => 'Удалить страницу'
            ],
            'list' => [
                'title' => 'Редактировать статические страницы',
                'add' => 'Добавить статическую страницу',
                'table' => [
                    'id' => '',
                    'name' => 'Заголовок',
                    'url' => 'Адрес',
                    'created_at' => 'Дата добавления',
                    'updated_at' => 'Дата последнего редактирования',
                    'edit' => 'Редактировать'
                ],
                'empty' => 'Статических страниц пока нет...'
            ]
        ],
        'users' => [
            'edit' => [
                'title' => 'Редактировать пользователя :username',
                'unblock' => 'Разблокировать',
                'username' => 'Имя пользователя',
                'email' => 'Адрес электронной почты',
                'balance' => 'Баланс',
                'password' => 'Новый пароль',
                'other' => [
                    'title' => 'Другое',
                    'in_game_cart' => 'Просмотр внутриигровой корзины',
                    'sessions' => 'Сбросить все логин - сессии данного пользователя',
                    'block' => 'Заблокировать пользователя'
                ],
                'remove' => 'Удалить пользователя',
                'cart_modal' => [
                    'title' => 'Просмотр внутриигровой корзины',
                    'btn' => 'Понятно',
                    'table' => [
                        'image' => 'Изображение',
                        'item' => 'Предмет',
                        'count' => 'Количество / длительность',
                        'server' => 'Сервер'
                    ],
                    'empty' => 'Корзина пуста'
                ],
                'block_modal' => [
                    'title' => 'Заблокировать пользователя',
                    'btn' => 'Заблокировать',
                    'cancel' => 'Отменить',
                    'duration' => 'Длительность блокировки',
                    'duration_popover' => 'Здесь указывается длительность блокировки пользователя в днях. Для того, чтобы заблокировать пользователя навсегда, введите нуль (0).',
                    'reason' => 'Причина блокировки',
                    'reason_popover' => 'Причина блокировки указывается, дабы вы и сам пользователь знали о том, за что его аккаунт заблокировали. Это поле необязательно для заполнения.',
                ]
            ],
            'list' => [
                'title' => 'Редактировать пользователей',
                'search' => [
                    'placeholder' => 'Искать пользователей',
                    'lets_typing' => 'Начните вводить...',
                    'nothing' => 'Ничего не найдено',
                    'wait' => 'Поиск...',
                    'popover' => 'Введите сюда логин, почту, баланс, дабы осуществить поиск по пользователям. Так же, вы можете искать пользователей, используя спец. правила.
                        Так, запрос <strong>&gt;520</strong> выберет всех пользователей, баланс которых больше 520. <strong>&lt;100</strong> - меньше 100. <strong>=0</strong> - Тех, у кого на балансе нет средств.'
                ],
                'table' => [
                    'id' => 'ID',
                    'username' => 'Имя пользователя',
                    'email' => 'Почта',
                    'balance' => 'Баланс',
                    'admin' => 'Администратор',
                    'edit' => 'Редактировать',
                    'status' => 'Статус аккаунта',
                    'blocked' => 'Заблокирован',
                    'blocked_popover_title' => 'Информация о блокировке',
                    'activated' => 'Подтвержден',
                    'activated_popover_title' => 'Информация о подтверждении',
                    'activate' => 'Подтвердить',
                    'activated_info' => 'Аккаунт этого пользователя подтвержден :date.'
                ]
            ]
        ],
        'other' => [
            'rcon' => [
                'title' => 'RCON консоль',
                'select_server' => 'Для начала выберите сервер.',
                'enter_cmd' => 'Введите команду',
                'exec' => 'Выполнить',
                'options' => 'Опции',
                'hide_sent' => 'Опции',
                'colorize' => 'Раскрашивать ответ',
                'colorize_popover' => 'Сервер Minecraft отдает цветные сообщения с использованием собственного форматирования. Если эта опция включена, система будет преобразовывать спец. символы в HTML разметку, понятную браузеру.',
            ],
            'debug' => [
                'title' => 'Отладка',
                'mail' => [
                    'title' => 'Почта',
                    'description' => 'Тестовое письмо поможет проверить как работает функция отправки email-сообщений.',
                    'address' => 'Адрес электронной почты, на который будет отправлено письмо',
                    'send' => 'Отправить',
                    'fail' => 'Во время отправки сообщения произошла ошибка:',
                    'fail_log' => 'Полные сведения о ней, а так же стэк трейс были записаны в лог.',
                ]
            ],
            'statistics' => [
                'show' => [
                    'title' => 'Просмотр статистики',
                    'orders_per_year' => 'Динамика совершенных заказов за этот год:',
                    'profit_per_year' => 'Динамика получения прибыли за этот год:',
                    'orders_per_month' => 'Динамика совершенных заказов за ',
                    'profit_per_month' => 'Динамика получения прибыли за ',
                    'profit' => 'Общая прибыль: :profit :currency',
                    'clear_cache' => 'Очистить кэш статистики'
                ],
                'payments' => [
                    'title' => 'История покупок и платежей пользователей',
                    'table' => [
                        'user' => 'Пользователь',
                    ]
                ]
            ],
            'info' => [
                'about' => [
                    'title' => 'О системе L-Shop',
                    'description' => '<strong>L - Shop</strong> - это проект с открытым исходным кодом, целая система, призванная помочь администраторам игровых серверов Minecraft упростить процесс продажи виртуальных товаров.',
                    'lshop_version' => 'Версия системы L - Shop',
                    'laravel_version' => 'Версия фреймворка Laravel',
                    'github' => 'GitHub репозиторий',
                    'rubukkit' => 'Топик на RuBukkit.org',
                    'developers' => 'Разработчики',
                    'd3lph1_description' => '<strong>Программный код</strong>. Вы можете обратиться ко мне за техничекой поддержкой.',
                    'whiled0s_description' => '<strong>Дизайн и верстка</strong>. Вы можете обратиться ко мне для того, чтобы заказть разработку уникального дизайна для вашего сайта, в том числе, для приложения, базирующегося на системе L-Shop.',
                ],
                'docs' => [
                    'title' => 'Документация',
                    'main' => 'Основные сведения по работе с системой',
                    'api' => 'Документация по API L - Shop',
                    'sashok' => 'Гайд по интеграции Sashok724\'s Launcher',
                    'cli' => 'Документация по CLI L - Shop',
                    'read' => 'Читать'
                ]
            ]
        ]
    ],
    'shop' => [
        'server_name' => 'Сервер: ',
        'catalog' => [
            'title' => 'Каталог товаров',
            'category_empty' => 'Категория пуста',
            'item' => [
                'forever' => 'Навсегда',
                'for' => 'за',
                'items' => 'шт.',
                'duration' => 'дн.',
                'already_in_cart' => 'Уже в корзине',
                'put_in_cart' => 'В корзину',
                'fast_buy' => 'Быстрая покупка',
            ],
            'fast_buy_modal' => [
                'title' => 'Быстрая покупка',
                'next_btn' => 'Продолжить',
                'cancel_btn' => 'Отменить',
                'username' => 'Имя пользователя',
                'auth' => 'С вашего счёта будет списана сумма в размере :span :currency
                    Если же средств недостаточно, вы будете автоматически перенаправлены на страницу оплаты.',
                'guest' => 'Вы будете перенаправлены на страницу выбора способа оплаты. Сумма заказа: :span :currency',
            ]
        ],
        'cart' => [
            'title' => 'Корзина',
            'username' => 'Имя пользователя',
            'total' => 'Итого:',
            'pay' => 'Сформировать и оплатить',
            'empty' => 'Корзина пуста',
            'item' => [
                'remove' => 'Убрать',
                'count' => 'Количество',
                'duration' => 'Длительность (Дн.)',
                'forever' => 'Этот товар приобретается навсегда.',
                'total' => 'К оплате:'
            ]
        ],
        'news' => [
            'read_more' => 'Подробнее...',
            'empty' => 'Новости отстуствуют'
        ]
    ],
    'profile' => [
        'fillupbalance' => [
            'title' => 'Пополнить баланс',
            'sum' => 'Сумма пополнения',
            'pay' => 'Перейти к оплате'
        ],
        'settings' => [
            'title' => 'Настройки',
            'security' => [
                'title' => 'Безопасность',
                'change_password' => 'Сменить пароль',
                'password' => 'Новый пароль',
                'password_confirmation' => 'Повторите пароль',
            ],
            'sessions' => [
                'title' => 'Сброс логин - сессий',
                'description' => 'После нажатия на кнопку ниже, все логин - сессии (В том числе и текущая) будут сброшены. Это может оказаться
                    полезным тогда, когда вы хотите выйти из аккаунта на устройствах, к которым у вас нет доступа.',
                'reset' => 'Сбросить'
            ]
        ],
        'character' => [
            'title' => 'Персонаж',
            'select_file' => 'Выбрать файл',
            'update' => 'Обновить',
            'max_file_size' => 'Максимальный размер файла - <strong>:size</strong> КБ.',
            'skin' => [
                'max_image_size' => 'Размер изображения - <strong>64x32</strong>',
                'max_image_size_hd' => 'Максимальные размеры изображения - <strong>1024x512</strong>',
            ],
            'clock' => [
                'not_set' => 'Плащ не установлен',
                'max_image_size' => 'Размер изображения - <strong>22x17</strong>',
                'max_image_size_hd' => 'Максимальные размеры изображения - <strong>1024x512</strong>',
            ]
        ],
        'payments' => [
            'title' => 'История покупок и платежей',
            'table' => [
                'id' => 'ID',
                'type' => 'Тип',
                'products' => 'Товары',
                'sum' => 'Сумма',
                'status' => 'Статус',
                'created_at' => 'Создан',
                'completed_at' => 'Завершен',
                'service' => 'Сервис',
                'actions' => 'Действия',
                'shopping' => 'Покупка товаров',
                'fillupbalance' => 'Пополнение баланса',
                'more' => 'Подробнее...',
                'completed' => 'Завершен',
                'not_completed' => 'Не завершен',
                'completed_by_admin' => 'Завершен администратором',
                'complete' => 'Завершить',
                'pay' => 'Оплатить',
                'empty' => 'История платежей пуста',
                'details_modal' => [
                    'title' => 'Информация о товарах платежа',
                    'btn' => 'Понятно',
                    'table' => [
                        'image' => 'Изображение',
                        'name' => 'Название',
                        'count' => 'Количество /',
                    ]
                ]
            ]
        ],
        'cart' => [
            'title' => 'Внутриигровая корзина',
            'description' => 'На этой странице вы можете просмотреть все товары, которые вы приобрели, но еще не забрали в игре.',
            'any' => 'Любой',
            'table' => [
                'image' => 'Изображение',
                'item' => 'Предмет',
                'count' => 'Количество / длительность'
            ],
            'empty' => 'Корзина пуста'
        ]
    ],

    'monitoring' => [
        'title' => 'Мониторинг серверов',
        'cancel' => 'Отмена',
        'server_disabled' => 'Сервер отключен',
        'error' => 'Не удалось получить информацию с сервера'
    ],

    'payments' => [
        'methods' => [
            'title' => 'Выберите способ оплаты',
            'nothing' => 'Нет ни одного доступного способа оплаты'
        ]
    ],

    'auth' => [
        'signin' => [
            'title' => 'Вход',
            'only_for_admins' => 'Вход только для администраторов',
            'btn' => 'Войти',
            'forgot' => 'Я забыл пароль',
            'signup' => 'Регистрация',
            'guest' => 'Покупка без авторизации',
        ],
        'signup' => [
            'title' => 'Регистрация',
            'btn' => 'Зарегистрироваться',
            'signin' => 'Вход',
        ],
        'servers' => [
            'title' => 'Выбор сервера',
            'signin' => 'Войти'
        ],
        'forgot' => [
            'title' => 'Восстановление пароля',
            'btn' => 'Восстановить'
        ],
        'reset_password' => [
            'title' => 'Сброс пароля',
            'password' => 'Новый пароль',
            'password_confirmation' => 'Повторите новый пароль',
            'btn' => 'Сбросить',
        ],
        'activate_wait' => [
            'title' => 'Активация',
            'description' => 'На почтовый ящик, указанный вами при регистрации отправлено письмо с подтверждением регистрации.
                              Проверьте почту и перейдите по ссылке в письме.<br>
                              Если письмо не пришло, вы можете отправить его заново.',
            'repeat' => 'Отправить повторно'
        ]
    ],

    'errors' => [
        '403' => [
            'title' => '403 | Запрещено',
            'content' => 'Запрещено',
            'btn' => 'На главную',
        ],
        '404' => [
            'title' => '404 | Не найдено',
            'content' => 'Запрашиваемая вами страница не найдена',
            'btn' => 'На главную',
        ],
        '500' => [
            'title' => '500 | Внутренняя ошибка сервера',
            'content' => 'Упс... Кажется, что-то пошло не так.'
        ],
        '503' => [
            'title' => '503 | Сервис временно недоступен',
            'content' => 'Сервис временно недоступен'
        ]
    ],

    'all' => [
        'save' => 'Сохранить',
        'update' => 'Обновить',
        'clear' => 'Очистить',
        'copy' => 'Копировать',
        'select' => 'Выбрать',
        'yes' => 'Да',
        'no' => 'Нет',
        'server' => 'Сервер',
        'username' => 'Имя пользователя',
        'email' => 'Адрес электронной почты',
        'password' => 'Пароль',
        'password_confirmation' => 'Повторите пароль',
        'logout' => 'Выйти'
    ],

    'months' => [
        1 => 'Январь',
        2 => 'Февраль',
        3 => 'Март',
        4 => 'Апрель',
        5 => 'Май',
        6 => 'Июнь',
        7 => 'Июль',
        8 => 'Август',
        9 => 'Сентябрь',
        10 => 'Октябрь',
        11 => 'Ноябрь',
        12 => 'Декабрь',
    ]
];
