<?php

return [
    'frontend' => [
        'auth' => [
            'login' => [
                'title' => 'Вход',
                'login' => 'Войти',
                'purchase_without_auth' => 'Покупка без авторизации',
                'forgot_password' => 'Забыли пароль?',
                'logout' => 'Выйти'
            ],
            'register' => [
                'title' => 'Регистрация'
            ],
            'activation' => [
                'sent' => [
                    'title' => 'Ожидание активации',
                    'description' => 'На почтовый ящик, указанный вами, отправлено письмо для подтверждения регистрации.
                              <p><p>Если письмо не пришло, вы можете отправить его заново.</p></p>',
                    'repeat' => 'Отправить повторно'
                ]
            ],
            'password' => [
                'forgot' => [
                    'title' => 'Восстановление пароля',
                    'continue' => 'Продолжить'
                ],
                'reset' => [
                    'title' => 'Сбросить пароль'
                ]
            ],
            'servers' => [
                'title' => 'Выбор сервера'
            ]
        ],
        'shop' => [
            'layout' => [
                'server_not_selected' => 'Не выбран'
            ],
            'catalog' => [
                'title' => 'Каталог товаров',
                'categories_does_not_exists' => 'Категории отсутствуют',
                'empty_category' => 'Категория пуста',
                'item' => [
                    'enchanted' => 'Этот предмет зачарован',
                    'put_in_cart' => 'В корзину',
                    'already_in_cart' => 'Уже в корзине',
                    'about' => 'Информация о товаре',
                    'go_to_product' => 'Перейти к товару',
                    'go_to_item' => 'Перейти к предмету',
                    'quick_purchase' => 'Быстрая покупка',
                    'stack_item' => 'за :stack шт.',
                    'stack_permgroup' => 'на :stack дн.',
                    'stack_permgroup_forever' => 'навсегда'
                ],
                'purchase' => [
                    'title' => 'Быстрая покупка (:product)',
                    'username_description' => 'Этому пользователю будет выдан приобретенный товар',
                    'amount' => 'Количество товара',
                    'duration' => 'Длительность',
                    'cost' => 'К оплате: :cost :currency',
                    'not_enough' => 'На вашем счету недостаточно средств. После нажатия кнопки "оформить" вы
                        будете автоматически перенаправлены на страницу выбора способа оплаты.',
                    'not_auth' => 'После нажатия кнопки "оформить" вы
                        будете автоматически перенаправлены на страницу выбора способа оплаты.',
                    'purchase' => 'Оформить'
                ],
                'about' => [
                    'title' => 'Информация о товаре (:product)',
                    'description' => [
                        'empty' => 'Описание товара отсутствует',
                        'title' => 'Описание товара:'
                    ],
                    'type' => 'Тип:',
                    'enchantments' => 'Зачарован:'
                ]
            ],
            'cart' => [
                'title' => 'Корзина',
                'empty' => 'Корзина пуста',
                'item' => [
                    'remove' => 'Убрать',
                    'cost' => 'Стоимость:',
                    'forever' => 'Этот товар приобретается навсегда'
                ]
            ]
        ],
        'profile' => [
            'character' => [
                'title' => 'Персонаж',
                'upload' => 'Обновить',
                'skin' => [
                    'image_resolutions' => 'Вы можете загружать изображения скинов со следующим(и) разрешениями: :resolutions.',
                    'file_size' => 'Максимальный размер файла скина: :size КБ.'
                ],
                'cloak' => [
                    'not_set' => 'Плащ не установлен',
                    'image_resolutions' => 'Вы можете загружать изображения плащей со следующим(и) разрешениями: :resolutions.',
                    'file_size' => 'Максимальный размер файла плаща: :size КБ.'
                ]
            ],
            'settings' => [
                'title' => 'Настройки',
                'password_change' => [
                    'title' => 'Сменить пароль',
                    'new' => 'Новый пароль',
                    'new_confirmation' => 'Повторите новый пароль'
                ],
                'login_reset' => [
                    'title' => 'Сброс логин-сессий',
                    'description' => 'После нажатия на кнопку ниже, все логин-сессии (В том числе, и текущая) будут сброшены. Это может оказаться полезным в случае, если вы хотите выйти из аккаунта на устройствах, к которым нет доступа.',
                    'reset' => 'Сбросить'
                ]
            ]
        ],
        'news' => [
            //
        ]
    ],
    'admin' => [
        'control' => [
            'basic' => [
                'title' => 'Основные настройки'
            ],
        ],
        'products' => [
            'add' => [
                'title' => 'Добавить товар',
                'item' => 'Предмет',
                'server' => 'Сервер, к которому будет привязан товар',
                'category' => 'Категория, к которой будет привязан товар',
                'no_categories' => 'На выбранном сервере отсутствуют категории',
                'item_stack' => 'Количество товара в 1 стаке',
                'permgroup_stack' => 'Длительность привилегии',
                'forever' => 'Привилегия приобретается навсегда',
                'price' => 'Цена за 1 стак товара',
                'sort_priority' => 'Приоритет сортировки товара в каталоге',
                'hide' => 'Скрыть товар из каталога',
                'finish' => 'Завершить добавление товара'
            ],
            'edit' => [
                'title' => 'Редактирование товара',
                'finish' => 'Завершить редактирование товара'
            ],
            'list' => [
                'title' => 'Список товаров',
                'search' => 'Поиск по товарам',
                'table' => [
                    'headers' => [
                        'id' => 'Идентификатор',
                        'price' => 'Цена',
                        'stack' => 'Количество/Длительность',
                        'image' => 'Изображение предмета',
                        'item' => 'Название предмета',
                        'type' => 'Тип предмета'
                    ],
                    'empty' => 'Список предметов пуст'
                ],
                'delete' => 'Вы уверены, что хотите удалить этот товар?'
            ]
        ],
        'items' => [
            'add' => [
                'title' => 'Добавить предмет',
                'name' => 'Название предмета',
                'description' => 'Описание предмета',
                'item' => [
                    'id' => 'Внутриигровой идентификатор предмета'
                ],
                'permgroup' => [
                    'id' => 'Внутриигровой идентификатор привилегии'
                ],
                'image' => [
                    'default' => 'Стандартное',
                    'upload' => 'Загрузить',
                    'browse' => 'Обзор'
                ],
                'browser' => [
                    'title' => 'Изображения предметов в файловой системе сервера',
                    'select' => 'Выбрать изображение',
                    'name' => 'Имя файла'
                ],
                'enchantment' => [
                    'title' => 'Стол зачарования',
                    'description' => 'Выберите интенсивность нужных чар и закройте диалоговое окно. Помните, большинство чар могут сочетаться только с определенными чарами.'
                ],
                'extra' => 'Extra',
                'finish' => 'Завершить создание'
            ],
            'edit' => [
                'title' => 'Редактирование предмета',
                'finish' => 'Завершить редактирование',
                'image' => [
                    'current' => 'Текущее'
                ]
            ],
            'list' => [
                'title' => 'Список предметов',
                'search' => 'Поиск по предметам',
                'table' => [
                    'headers' => [
                        'id' => 'Идентификтаор',
                        'name' => 'Название'
                    ],
                    'loading' => 'Информация о предметах загружается...',
                    'empty' => 'Список предметов пуст'
                ],
                'delete' => 'Вы уверены, что хотите удалить предмет ":name"?'
            ],
        ],
        'news' => [
            'add' => [

            ],
            'list' => [
                'title' => 'Список новостей',
                'search' => 'Поиск по новостям',
                'table' => [
                    'headers' => [
                        'id' => 'Идентификтаор',
                        'title' => 'Заголовок',
                        'username' => 'Автор новости',
                        'created_at' => 'Дата и время создания'
                    ],
                    'loading' => 'Информация о новостях загружается...',
                    'empty' => 'Список новостей пуст'
                ]
            ],
        ],
        'pages' => [
            'add' => [
                'title' => 'Добавить статическую страницу',
                'title_input' => 'Заголовок статической страницы',
                'content' => 'Содержимое страницы',
                'url' => 'Адрес страницы',
                'url_auto' => 'Сгенерировать адрес автоматически',
                'finish' => 'Завершить создание'
            ],
            'edit' => [
                'title' => 'Редактировать статическую страницу'
            ],
            'list' => [
                'title' => 'Список статических страниц',
                'search' => 'Поиск по статическим страницам',
                'table' => [
                    'headers' => [
                        'id' => 'Идентификтаор',
                        'title' => 'Заголовок',
                        'url' => 'Адрес страницы'
                    ],
                    'loading' => 'Информация о статических страницах загружается...',
                    'empty' => 'Список статических страницах пуст'
                ],
                'delete' => 'Вы уверены, что хотите удалить статическую страницу?'
            ],
        ],
        'users' => [
            'edit' => [
                'main' => [
                    'title' => 'Редактировать пользователя',
                    'new_password' => 'Новый пароль',
                    'roles' => 'Роли пользователя',
                    'permissions' => 'Права пользователя',
                    'finish' => 'Завершить редактирование',
                ],
                'actions' => [
                    'title' => 'Действия с пользователем',
                    'activated_at' => 'Пользователь активирован :datetime.',
                    'banned' => 'Пользователь заблокирован',
                    'show_bans_history' => 'Просмотр истории блокировок',
                    'bans_history' => [
                        'title' => 'История блокировок пользователя :username',
                        'created_at' => 'Дата выдачи блокировки',
                        'until' => 'Дата окончания блокировки',
                        'reason' => 'Причина',
                        'delete' => 'Вы уверены, что хотите удалить блокировку?',
                        'caption' => 'неистекшие блокировки'
                    ],
                    'show_ban_dialog' => 'Заблокировать пользователя',
                    'show_add_ban_dialog' => 'Добавить блокировку пользователю',
                    'add_ban' => [
                        'forever' => 'Заблокировать навсегда',
                        'date' => 'Дата окончания блокировки',
                        'time' => 'Время окончания блокировки',
                        'reason' => 'Причина',
                        'finish' => 'Заблокировать'
                    ]
                ]
            ],
            'list' => [
                'title' => 'Список пользователей',
                'search' => 'Поиск по пользователям',
                'table' => [
                    'headers' => [
                        'id' => 'Идентификатор',
                        'states' => 'Состояния'
                    ],
                    'activated' => 'Аккаунт этого пользователя активирован',
                    'banned' => 'Этот пользователь заблокирован',
                    'loading' => 'Информация о пользователяях загружается...',
                    'empty' => 'Список пользователей пуст'
                ],
                'delete' => 'Вы уверены, что хотите удалить пользователя?'
            ]
        ],
        'statistic' => [
            'show' => [
                'title' => 'Просмотр статистики'
            ]
        ],
        'information' => [
            'about' => [
                'title' => 'О системе L-Shop',
                'description' => '<strong>L - Shop</strong> - это проект с открытым исходным кодом, целая система,
                призванная помочь администраторам игровых серверов Minecraft упростить процесс продажи виртуальных товаров.',
                'version' => 'Версия :version',
                'lshop_version' => 'Версия L-Shop: :version',
                'developers_title' => 'Разработчики',
                'developers' => [
                    'D3lph1' => [
                        'name'  => 'Богдан',
                        'description' => [
                            'plain' => 'Программный код: backend и frontend. Вы можете обратиться ко мне за техничекой поддержкой, а так же для заказа разработки различного программного обеспечения.',
                            'html' => '<span class="text--primary">Программный код: backend и frontend.</span> Вы можете обратиться ко мне за техничекой поддержкой, а так же для заказа разработки различного программного обеспечения.'
                        ]
                    ],
                    'WhileD0S' => [
                        'name' => 'Михаил',
                        'description' => [
                            'plain' => 'Дизайн и верстка. Вы можете обратиться ко мне для того, чтобы заказть разработку уникального дизайна для вашего сайта, в том числе, для сайта, базирующегося на системе L-Shop.',
                            'html' => '<span class="text--primary">Дизайн и верстка.</span> Вы можете обратиться ко мне для того, чтобы заказть разработку уникального дизайна для вашего сайта, в том числе, для сайта, базирующегося на системе L-Shop.'
                        ]
                    ]
                ]
            ]
        ]
    ],
    'layout' => [
        'shop' => [
            'server' => 'Сервер:',
            'sidebar' => [
                'basic' => [
                    'catalog' => 'Каталог',
                    'cart' => 'Корзина',
                    'servers' => 'К выбору серверов'
                ],
                'profile' => [
                    'title' => 'Профиль',
                    'character' => 'Персонаж',
                    'settings' => 'Настройки',
                    'information' => [
                        'title' => 'Информация',
                        'sub_items' => [
                            'payments' => 'История платежей',
                            'cart' => 'Внутриигровая корзина'
                        ]
                    ]
                ],
                'admin' => [
                    'title' => 'Администрирование',
                    'control' => [
                        'title' => 'Управление',
                        'sub_items' => [
                            'main_settings' => 'Основные настройки',
                            'payments' => 'Платежи',
                            'api' => 'API',
                            'security' => 'Безопасность',
                            'optimization' => 'Оптимизация'
                        ]
                    ],
                    'servers' => [
                        'title' => 'Серверы',
                        'sub_items' => [
                            'add' => 'Добавить',
                            'edit' => 'Редактировать'
                        ]
                    ],
                    'products' => [
                        'title' => 'Товары',
                        'sub_items' => [
                            'add' => 'Добавить',
                            'edit' => 'Редактировать'
                        ]
                    ],
                    'items' => [
                        'title' => 'Предметы',
                        'sub_items' => [
                            'add' => 'Добавить',
                            'edit' => 'Редактировать'
                        ]
                    ],
                    'news' => [
                        'title' => 'Новости',
                        'sub_items' => [
                            'add' => 'Добавить',
                            'edit' => 'Редактировать'
                        ]
                    ],
                    'pages' => [
                        'title' => 'Статические страницы',
                        'sub_items' => [
                            'add' => 'Добавить',
                            'edit' => 'Редактировать'
                        ]
                    ],
                    'users' => [
                        'title' => 'Пользователи',
                        'sub_items' => [
                            'edit' => 'Редактировать'
                        ]
                    ],
                    'other' => [
                        'title' => 'Другое',
                        'sub_items' => [
                            'rcon' => 'RCON консоль',
                            'debug' => 'Отладка',
                        ]
                    ],
                    'statistic' => [
                        'title' => 'Статистика',
                        'sub_items' => [
                            'show' => 'Просмотр статистики',
                            'payments' => 'История платежей',
                        ]
                    ],
                    'info' => [
                        'title' => 'Информация',
                        'sub_items' => [
                            'docs' => 'Документация',
                            'about' => 'О системе L-Shop',
                        ]
                    ]
                ]
            ],
            'settings' => [
                'title' => 'Локальные настройки'
            ],
            'monitoring' => [
                'title' => 'Мониторинг серверов',
                'disabled' => 'Отключен',
                'failed' => 'Ошибка'
            ]
        ],
        'news' => [
            'empty' => 'Новости отсутствуют',
            'read' => 'Читать полностью',
            'load' => 'Загрузить ещё'
        ]
    ]
];
