<?php

return [
    'frontend' => [
        'auth' => [
            'login' => [
                'title' => 'Вход',
                'login' => 'Войти',
                'purchase_without_auth' => 'Покупка без авторизации',
                'forgot_password' => 'Забыли пароль?',
                'logout' => 'Выйти'
            ],
            'register' => [
                'title' => 'Регистрация'
            ],
            'activation' => [
                'sent' => [
                    'title' => 'Ожидание активации',
                    'description' => 'На почтовый ящик, указанный вами, отправлено письмо для подтверждения регистрации.
                              <p><p>Если письмо не пришло, вы можете отправить его заново.</p></p>',
                    'repeat' => 'Отправить повторно'
                ]
            ],
            'password' => [
                'forgot' => [
                    'title' => 'Восстановление пароля',
                    'continue' => 'Продолжить'
                ],
                'reset' => [
                    'title' => 'Сбросить пароль'
                ]
            ],
            'servers' => [
                'title' => 'Выбор сервера'
            ]
        ],
        'shop' => [
            'layout' => [
                'server_not_selected' => 'Не выбран'
            ],
            'catalog' => [
                'title' => 'Каталог товаров',
                'item' => [
                    'put_in_cart' => 'В корзину',
                    'already_in_cart' => 'Уже в корзине',
                    'about' => 'Информация о товаре',
                    'quick_purchase' => 'Быстрая покупка',
                    'stack_item' => 'за :stack шт.',
                    'stack_permgroup' => 'на :stack дн.',
                    'stack_permgroup_forever' => 'навсегда'
                ],
                'purchase' => [
                    'title' => 'Быстрая покупка (:product)',
                    'username_description' => 'Этому пользователю будет выдан приобретенный товар',
                    'amount' => 'Количество товара',
                    'duration' => 'Длительность',
                    'cost' => 'К оплате: :cost :currency',
                    'not_enough' => 'На вашем счету недостаточно средств. После нажатия кнопки "оформить" вы
                        будете автоматически перенаправлены на страницу выбора способа оплаты.',
                    'not_auth' => 'После нажатия кнопки "оформить" вы
                        будете автоматически перенаправлены на страницу выбора способа оплаты.',
                    'purchase' => 'Оформить'
                ],
                'about' => [
                    'title' => 'Информация о товаре (:product)',
                    'description' => [
                        'empty' => 'Описание товара отсутствует',
                        'title' => 'Описание товара:'
                    ],
                    'type' => 'Тип:'
                ]
            ],
            'cart' => [
                'title' => 'Корзина',
                'empty' => 'Корзина пуста',
                'item' => [
                    'remove' => 'Убрать',
                    'cost' => 'Стоимость:',
                    'forever' => 'Этот товар приобретается навсегда'
                ]
            ]
        ]
    ],
    'admin' => [
        'control' => [
            'basic' => [
                'title' => 'Основные настройки'
            ],
        ],
        'products' => [
            'list' => [
                'title' => 'Список товаров',
                'search' => 'Поиск по товарам',
                'table' => [
                    'headers' => [
                        'id' => 'Идентификатор',
                        'price' => 'Цена',
                        'stack' => 'Количество/Длительность',
                        'image' => 'Изображение предмета',
                        'item' => 'Название предмета',
                        'type' => 'Тип предмета'
                    ],
                    'empty' => 'Список предметов пуст'
                ]
            ]
        ],
        'items' => [
            'list' => [
                'title' => 'Список предметов',
                'search' => 'Поиск по предметам',
                'table' => [
                    'headers' => [
                        'id' => 'Идентификтаор',
                        'name' => 'Название'
                    ],
                    'loading' => 'Информация о предметах загружается...',
                    'empty' => 'Список предметов пуст'
                ]
            ],
        ],
        'news' => [
            'list' => [
                'title' => 'Список новостей',
                'search' => 'Поиск по новостям',
                'table' => [
                    'headers' => [
                        'id' => 'Идентификтаор',
                        'title' => 'Заголовок',
                        'username' => 'Автор новости',
                        'created_at' => 'Дата и время создания'
                    ],
                    'loading' => 'Информация о новостях загружается...',
                    'empty' => 'Список новостей пуст'
                ]
            ],
        ],
        'pages' => [
            'list' => [
                'title' => 'Список статических страниц',
                'search' => 'Поиск по статическим страницам',
                'table' => [
                    'headers' => [
                        'id' => 'Идентификтаор',
                        'title' => 'Заголовок'
                    ],
                    'loading' => 'Информация о статических страницах загружается...',
                    'empty' => 'Список статических страницах пуст'
                ]
            ],
        ],
        'users' => [
            'list' => [
                'title' => 'Список пользователей',
                'search' => 'Поиск по пользователям',
                'table' => [
                    'headers' => [
                        'id' => 'Идентификатор',
                        'name' => 'Название'
                    ],
                    'loading' => 'Информация о пользователяях загружается...',
                    'empty' => 'Список пользователей пуст'
                ]
            ]
        ],
        'information' => [
            'about' => [
                'title' => 'О системе L-Shop',
                'developers' => [
                    'D3lph1' => [
                        'name'  => 'Богдан',
                        'description' => ''
                    ],
                    'WhileD0S' => [
                        'name' => 'Михаил',
                        'description' => ''
                    ]
                ]
            ]
        ]
    ],
    'layout' => [
        'shop' => [
            'sidebar' => [
                'basic' => [
                    'catalog' => 'Каталог',
                    'cart' => 'Корзина',
                    'servers' => 'К выбору серверов'
                ],
                'profile' => [
                    'title' => 'Профиль',
                    'character' => 'Персонаж',
                    'settings' => 'Настройки',
                    'information' => [
                        'title' => 'Информация',
                        'sub_items' => [
                            'payments' => 'История платежей',
                            'cart' => 'Внутриигровая корзина'
                        ]
                    ]
                ],
                'admin' => [
                    'title' => 'Администрирование',
                    'control' => [
                        'title' => 'Управление',
                        'sub_items' => [
                            'main_settings' => 'Основные настройки',
                            'payments' => 'Платежи',
                            'api' => 'API',
                            'security' => 'Безопасность',
                            'optimization' => 'Оптимизация'
                        ]
                    ],
                    'servers' => [
                        'title' => 'Серверы',
                        'sub_items' => [
                            'add' => 'Добавить',
                            'edit' => 'Редактировать'
                        ]
                    ],
                    'products' => [
                        'title' => 'Товары',
                        'sub_items' => [
                            'add' => 'Добавить',
                            'edit' => 'Редактировать'
                        ]
                    ],
                    'items' => [
                        'title' => 'Предметы',
                        'sub_items' => [
                            'add' => 'Добавить',
                            'edit' => 'Редактировать'
                        ]
                    ],
                    'news' => [
                        'title' => 'Новости',
                        'sub_items' => [
                            'add' => 'Добавить',
                            'edit' => 'Редактировать'
                        ]
                    ],
                    'pages' => [
                        'title' => 'Статические страницы',
                        'sub_items' => [
                            'add' => 'Добавить',
                            'edit' => 'Редактировать'
                        ]
                    ],
                    'users' => [
                        'title' => 'Пользователи',
                        'sub_items' => [
                            'edit' => 'Редактировать'
                        ]
                    ],
                    'other' => [
                        'title' => 'Другое',
                        'sub_items' => [
                            'rcon' => 'RCON консоль',
                            'debug' => 'Отладка',
                        ]
                    ],
                    'statistic' => [
                        'title' => 'Статистика',
                        'sub_items' => [
                            'show' => 'Просмотр статистики',
                            'payments' => 'История платежей',
                        ]
                    ],
                    'info' => [
                        'title' => 'Информация',
                        'sub_items' => [
                            'docs' => 'Документация',
                            'about' => 'О системе L-Shop',
                        ]
                    ]
                ]
            ],
            'settings' => [
                'title' => 'Локальные настройки'
            ]
        ],
        'news' => [
            'empty' => 'Новости отсутствуют',
            'read' => 'Читать полностью',
            'load' => 'Загрузить ещё'
        ]
    ]
];
