<?php

return [
    'admin' => [
        'save' => 'Сохранить изменения',

        'control' => [
            'main_settings' => [
                'title' => 'Основные настройки',
                'shop' => [
                    'title' => 'Магазин',
                    'edit_info' => 'Редактировать основную информацию о магазине.',
                    'name' => 'Имя магазна',
                    'name_popover' => 'Имя магазина будет отображаться на главной страницы а также в заголовках страниц.',
                    'description' => 'Описание магазина',
                    'description_popover' => 'Описание магазина используется в основном поисковыми системами для индексации ресурса.',
                    'keywords' => 'Ключевые слова',
                    'keywords_popover' => 'Ключевые слова используются в основном поисковыми системами для индексации ресурса. Их нужно перечислять через запятую без пробелов.',

                    'sort_attr' => 'Сортировать товары по:',
                    'sort_attr_name' => 'Названию предмета (А -> Я)',
                    'sort_attr_name_desc' => 'Названию предмета (Я -> А)',
                    'sort_attr_sort_priority' => 'Приоритету сортировки товара (1 -> N)',
                    'sort_attr_sort_priority_desc' => 'Приоритету сортировки товара (N -> 1)',

                ],
                'access_mode' => [
                    'title' => 'Режим доступа',
                    'description' => 'Этот параметр регулирует то, каким образом пользователи смогут получать доступ к магазину.<br>
                    <strong>Только гости</strong>: авторизация в магазине отключена, пользователи будут приобретать товары без входа в аккаунт.<br>
                    <strong>Только авторизованные пользователи</strong>: авторизация в магазине является обязательной, товары могут преобретать
                    только пользователи, вошедшие в свой аккаунт.<br>
                        <strong>И гости и авторизованные пользователи</strong>: Пользователи могут совершать покупки как войдя в аккаунт, так и
                    без входа в него.',
                    'guest' => 'Только гости',
                    'auth' => 'Только авторизованные пользователи',
                    'all' => 'И гости и авторизованные пользователи',
                ],
                'register' => [
                    'title' => 'Регистрация',
                    'enable' => 'Разрешить регистрацию новых пользователей',
                    'send_mail' => 'Включить отправку писем на почту пользователям для подтверждения аккаунта',
                    'send_mail_popover' => 'Если опция включена, то после регистрации пользователю будет отправляться письмо на указанный им email. Это необходимо, дабы подтвердить валидность адреса электронной почты.',
                    'redirect' => 'Перенаправлять пользователя на кастомный URL после регистрации',
                    'redirect_popover' => 'Если опция включена, то после регистрации пользователь будет перенаправлен на URL, который указан в поле ниже.',
                    'url' => 'Кастомный URL',
                ],
                'skins' => [
                    'title' => 'Скины и плащи',
                    'enable' => 'Разрешить пользователям устанавливать скины',
                    'enable_popover' => 'Игроки смогут устанавливать <strong>скины</strong> для своих персонажей. Если отключена возможность установки HD скинов, то размер скина должен быть равен <strong>64x32</strong> пикселя.',
                    'hd' => 'Разрешить пользователям устанавливать HD скины',
                    'hd_popover' => 'Игроки смогут устанавливать <strong>HD скины</strong> для воих персонажей. Максимадьный размер изображения - <strong>1024x512</strong>.',
                    'size' => 'Максимальный размер файла скина',
                    'size_popover' => 'Размер следует указывать в <strong>килобайтах</strong>.',
                ],
                'cloaks' => [
                    'enable' => 'Разрешить пользователям устанавливать плащи',
                    'enable_popover' => 'Игроки смогут устанавливать <strong>плащи</strong> для своих персонажей. Если отключена возможность установки HD скинов, то размер скина должен быть равен <strong>22x17</strong> пикселя.',
                    'hd' => 'Разрешить пользователям устанавливать HD плащи',
                    'hd_popover' => 'Игроки смогут устанавливать <strong>HD плащи</strong> для cвоих персонажей. Максимальный размер изображения - <strong>1024x512</strong>.',
                    'size' => 'Максимальный размер файла плащи',
                    'size_popover' => 'Размер следует указывать в <strong>килобайтах</strong>.',
                ],
                'news' => [
                    'title' => 'Новости',
                    'enable' => 'Включить показ новостей',
                    'first_portion' => 'Количество новостей, находящихся на экране при загрузке',
                    'load_portion' => 'Количество подгружаемых за раз новостей',
                ],
                'pagination' => [
                    'title' => 'Пагинация',
                    'shop_products_per_page' => 'Количество товаров на 1 странице магазина',
                    'profile_payments_per_page' => 'Количество элементов на 1 странице истории платежей в профиле пользователя',
                    'profile_in_game_cart_per_page' => 'Количество элементов на 1 странице внутриигровой корзины в профиле пользователя',
                ],
                'cart' => [
                    'title' => 'Корзина',
                    'capacity' => 'Максимальная вместимость корзины'
                ],
                'monitoring' => [
                    'title' => 'Мониторинг',
                    'enable' => 'Включить мониторинг серверов',
                    'timeout' => 'Таймаут соединения',
                    'timeout_popover' => 'Время, после которого произойдет автоматическое отключение соединения с сокетом сервера. (Если не произошло соединение). Указывать следует в секундах.',
                ],
                'maintenance' => [
                    'title' => 'Режим обслуживания',
                    'description' => 'Включить / отключить режим обслуживания. Этот режим закрывает доступ к сайту.
                    Доступ будет открыт только для администраторов. Также будет доступна страница авторизации
                    (Список доступных маршрутов вы можете изменить в свойстве <code>except</code>
                    посредника <code>App\Http\Middleware\CheckForMaintenanceMode</code>).
                    При этом, всем, кто вошел на сайт, будет показано какое либо сообщение. Изменить его вы
                    можете в файле <code>resources/view/errors/503.blade.php</code>.',
                    'enable' => 'Включить режим обслуживания'
                ]
            ],
            'payments' => [
                'title' => 'Платежи',
                'common' => [
                    'title' => 'Общее',
                    'min_sum' => 'Минимальная сумма пополнения баланса',
                    'currency' => 'Валюта',
                    'currency_name' => 'Название валюты',
                    'currency_html' => 'HTML представление валюты',
                ],
                'aggregators' => [
                    'title' => 'Платежные агрегаторы',
                    'robokassa' => [
                        'title' => 'Robokassa',
                        'change_data' => 'Изменение персональных данных сервиса Robokassa',
                        'login' => 'Логин',
                        'password1' => 'Пароль №1',
                        'password2' => 'Пароль №2',
                        'algo' => 'Алгоритм расчета контрольной суммы:',
                        'is_test' => 'Тестовый режим',
                    ]
                ]
            ],
            'api' => [
                'title' => 'API',
                'api_enable_alert' => 'Не забудьте включить API, перед началом его использования.',
                'api_doc_alert' => 'Подробную документацию по API вы можете найти',
                'api_doc_alert_btn' => 'тут',
                'enable_api' => [
                    'title' => 'Включить API',
                    'enable' => 'Включить',
                ],
                'key' => [
                    'title' => 'Ключ доступа',
                    'description' => 'С помощью данного ключа будут происходить все взаимодействия вашего ресурса с API l-shop. Длина ключа не должна быть меньше 32 символов.',
                    'secret_key' => 'Секретный ключ',
                    'alert' => 'Никогда и никому не сообщайте этот ключ! В противном случае, безопасность приложения будет под угрозой.',
                ],
                'algo' => [
                    'title' => 'Алгоритм хэширования',
                    'description' => 'При помощи этого алгоритма будет высчитываться контрольная сумма строки. Это необходимо для выполнения безопасного запроса к API.',
                    'alert' => 'Мы <strong>не рекомендуем</strong> использовать алгоритм <strong>md5</strong>, в силу его низкой устойчивости к перебору.'
                ],
                'separator' => [
                    'title' => 'Разделитель аргументов',
                    'description' => 'Этот символ будет разделять параметры в строке, из которой будет расчитываться контрольная сумма.',
                    'input' => 'Разделитель',
                ],
                'auth' => [
                    'title' => 'API - авторизация',
                    'enable' => 'Включить',
                    'remember' => 'Запоминать аутентифицированных пользователей'
                ],
                'register' => [
                    'title' => 'API - регистрация',
                    'enable' => 'Включить',
                ],
                'sashok' => [
                    'title' => 'Интеграция с Sashok724\'s Launcher',
                    'enable' => 'Включить',
                    'success_response' => [
                        'title' => 'Формат успешного ответа сервиса',
                        'description' => 'Данная строка будет "выведена" лаунчсерверу при успешной проверке введенных данных.
                            Маркер {username} будет заменен на имя пользователя. Например, если формат ответа OK:{username}, при успешной
                            проверке данных пользователя D3lph1, сервер получит ответ: OK:D3lph1.',
                        'format' => 'Формат'
                    ],
                    'fail_response' => [
                        'input' => 'Сообщение при неверном вводе данных пользователем'
                    ],
                    'whitelist' => [
                        'description' => 'Ниже вы можете ввести список ip-адресов, которые могут соединяться с L-Shop и проверять данные пользователей для авторизации в лаунчере.
                            Мы рекомендуем указать здесь ip вашего лаунчсервера. Оставьте поле пустым, дабы не использовать блокировку посторонних адресов (Не рекомендуется).',
                        'input' => 'Список разрешенных IP адресов (Разделитель - запятая. Например: 127.0.0.1, 192.168.0.1).'
                    ]
                ]
            ],
            'security' => [
                //
            ]
        ],
        'products' => [
            'add' => [
                'products_in_stack' => 'Количество товара в 1 стаке',
                'perm_duration' => 'Длительность привилегии (В днях). 0 - навсегда',
                'products_price' => 'Цена за стак товара',
                'perm_price' => 'Цена одного периода привилегии',
            ]
        ],
        'items' => [
            'add' => [
                'item_name' => 'Название предмета',
                'perm_name' => 'Название привилегии',
                'item_id' => 'ID или ID:DATA предмета',
                'perm_id' => 'Внутриигровой идентификатор привилегии',
            ]
        ],
        'users' => [
            'list' => [
                'search' => [
                    'placeholder' => 'Искать пользователей',
                    'lets_typing' => 'Начните вводить...',
                    'nothing' => 'Ничего не найдено',
                    'wait' => 'Поиск...'
                ]
            ]
        ]
    ],
    'shop' => [
        'server_name' => 'Сервер: ',
        'cart' => [
            'empty' => 'Корзина пуста'
        ],
        'news' => [
            'read_more' => 'Подробнее...'
        ]
    ]
];
