<?php

return [
    'names' => [
        0 => 'Защита',
        1 => 'Защита от огня',
        2 => 'Мягкое приземление',
        3 => 'Защита от взрыва',
        4 => 'Защита от снаряда',
        5 => 'Дыхание',
        6 => 'Родство с водой',
        7 => 'Шипы',

        16 => 'Острота',
        17 => 'Урон нежити',
        18 => 'Бич членистоногих',
        19 => 'Отбрасывание',
        20 => 'Поджог',
        21 => 'Мародерство',

        32 => 'Эффективность',
        33 => 'Шелковое касание',
        35 => 'Удача',

        48 => 'Сила',
        49 => 'Отбрасывание',
        50 => 'Воспламенение',
        51 => 'Бесконечность',

        34 => 'Прочность',
    ],
    'groups' => [
        'armor' => 'Броня',
        'weapons' => 'Оружие',
        'tools' => 'Инструменты',
        'bows' => 'Лук',
        null => 'Общее'
    ]
];
