<?php

return [
    'forgot_password' => [
        'subject' => 'Сброс пароля',
        'content' => '
        Привет, :username!
        Кто-то (Возможно, вы) отправил запрос на восстановление пароля. Для сброса пароля перейдите по ссылке ниже.<br>
        <a href=":link">СБРОСИТЬ</a><br>
        Если это были не вы, проигнорируйте сообщение.<br><br>
        <p>IP - адрес устройства, с которого был произведен запрос: :ip</p>
    '],
    'test' => [
        'subject' => 'Тестовое сообщение',
        'content' => 'Это тестовое сообщение отправлено с сайта :site, дабы выполнить проверку.'
    ],
    'user_activation' => [
        'subject' => 'Активация аккаунта',
        'content' => 'Привет, :username!
        Мы рады видеть нового пользователя, который стал частью нашего проекта.
        Для окончания процедуры регистрации, тебе необходимо перейти по ссылке:
        <a href=":link">ТЫК...</a>'
    ],
];
