<?php

return [
    'auth' => [
        'confirmation' => [
            'subject' => 'Подтверждение адреса электронной почты',
            'hello' => 'Привет, :user!',
            'description' => 'Мы рады видеть нового пользователя, который стал частью нашего проекта.<br>Для окончания процедуры регистрации, тебе необходимо перейти по ссылке ниже.',
            'complete' => 'Завершить регистрацию'
        ],
        'reminder' => [
            'subject' => 'Сброс пароля',
            'hello' => 'Привет, :user!',
            'description' => 'Кто-то (возможно, вы) отправил запрос на восстановление пароля. Для сброса пароля перейдите по ссылке ниже.',
            'reset' => 'Сбросить пароль',
            'warning' => 'Если вы не отправляли запрос, проигнорируйте это сообщение.'
        ]
    ],
    'test' => [
        'subject' => 'Тестовое письмо',
        'content' => 'Данное письмо было отправлено для проверки того, как работает функция работы с email. Если вы читаете это, значит отправка функционирует корректно.'
    ],
    'team' => 'Команда :name'
];
