<?php

return [
    'admin' => [
        'users' => [
            'edit' => [
                'block' => [
                    'successful' => [
                        'temporarily' => [
                            'with_reason' => 'Аккаунт этого пользователя заблокирован до :until по причине ":reason".',
                            'without_reason' => 'Аккаунт этого пользователя заблокирован до :until.'
                        ],
                        'permanently' => [
                            'with_reason' => 'Аккаунт этого пользователя заблокирован навсегда по причине ":reason".',
                            'without_reason' => 'Аккаунт этого пользователя заблокирован навсегда.'
                        ],
                    ],
                    'fail' => 'Заблокировать пользователя неудалось.',
                    'not_found' => 'Пользователь не найден.',
                    'cannot_block_yourself' => 'Вы не можете заблокировать самого себя.',
                ],
                'unblock' => [
                    'success' => 'Пользователь разблокирован.',
                    'fail' => 'Не удалось разблокировать пользователя.',
                    'not_found' => 'Пользователь не найден.'
                ],
                'save' => [
                    'success' => 'Пользователь успешно изменён.',
                    'fail' => 'Изменить пользователя неудалось вследствии ошибки.',
                    'username_already_exists' => 'Имя пользователя :username уже используется.',
                    'email_already_exists' => 'Адрес электронной почты :email уже используется.',
                    'not_found' => 'Пользователь не найден.'
                ]
            ]
        ],
        'rcon' => [
            'selected_server' => 'Выбран сервер: ',
            'empty_input' => 'Вам следует ввести команду!',
            'connect_error' => 'Не удалось подключится к сокету'
        ]
    ],
    'auth' => [
        'signin' => [
            'welcome' => 'Добро пожаловать, :username.',
            'frozen' => 'Вы произвели слишком большое количество попыток входа. Возможность авторизации будет недоступна последующие :delay секунд.',
            'not_activated' => 'Ваш аккаунт не активирован. Проверьте свою почту на наличие нашего письма.',
            'only_for_admins' => 'Вход обычным пользователям запрещен.',
            'invalid_credentials' => 'Пользователь с такими данными не найден.'
        ],

        'signup' => [
            'success' => 'Вы успешно зарегистрированы!',
            'fail' => 'Не удалось зарегистрировать пользователя, вследствии внутренней ошибки сервера.',
            'username_already_exists' => 'Имя пользователя :username уже используется.',
            'email_already_exists' => 'Адрес электронной почты :email уже используется.',
        ],

        'forgot' => [
            'success' => 'На вашу почту отправлено письмо с инструкциями по сбросу пароля.',
            'user_not_found' => 'Пользователь с таким адресом электронной почты не найден!'
        ],

        'reset' => [
            'success' => 'Пароль изменен успешно.',
            'fail' => 'Не удалось сменить пароль.',
            'invalid_code' => 'Код сброса пароля не существует или истек срок восстановления пароля.',
        ],

        'logout' => 'Вы вышли из аккаунта.'
    ],

    'profile' => [
        'password' => [
            'success' => 'Пароль успешно изменен!',
            'fail' => 'Не удалось изменить пароль.',
            'disabled' => 'Возможность смены пароля отключена.'
        ],
        'settings' => [
            'sessions' => 'Логин-сессии успешно сброшены. Вам потребуется авторизоваться заного.'
        ],
        'character' => [
            'skin' => [
                'success' => 'Новый скин установлен успешно!',
                'disabled' => 'Возможность смены скина отключена.',
                'invalid_ratio' => 'Неверный размер изображения.',
            ],
            'cloak' => [
                'success' => 'Новый плащ установлен успешно!',
                'disabled' => 'Возможность смены плаща отключена.',
                'invalid_ratio' => 'Неверный размер изображения.',
            ]
        ]
    ],

    'shop' => [
        'catalog' => [
            'buy' => [
                'success' => 'Покупка успешно совершена!',
                'invalid_username' => 'Имя пользователя слишком короткое или содержит недопустимые символы.',
                'invalid_count' => 'Недопустимое количество товара.',
            ],
            'news' => [
                'disabled' => 'Отображение новостей отключено',
                'no_more' => 'Новостей больше нет.',
            ]
        ],
        'cart' => [
            'buy' => [
                'success' => 'Покупка успешно совершена!',
                'invalid_username' => 'Имя пользователя слишком короткое или содержит недопустимые символы.',
                'invalid_count' => 'Недопустимое количество товара.',
            ],
            'success' => [
                'message' => 'Товар добавлен в корзину.',
                'btn' => 'Уже в корзине',
            ],
            'full' => 'Невозможно добавить товар. Корзина переполнена.',
            'already_in' => 'Товар уже есть в корзине.',
            'remove' => [
                'success' => 'Товар убран из корзины.',
                'fail' => 'Не удалось убрать товар из крзины.'
            ]
        ]
    ],

    'payments' => [
        'fillupbalance' => [
            'invalid_sum' => 'Сумма должна быть положительным числом и быть не меньше :min.'
        ]
    ],

    'success' => [
        'changes' => 'Изменения успешно сохраненеы!',
    ],
    'error' => [
        'request' => 'Во время выполнения запроса произошла ошибка',
        'changes' => 'Не удалось сохранить изменения'
    ],

    'request_error' => 'Во время выполнения запроса произошла ошибка.',
    'captcha_required' => 'Вы должны подтвердить то, что не являетесь роботом.'
];
