<?php

return [
    'frontend' => [
        'auth' => [
            'login' => [
                'invalid_credentials' => 'Пользователь с такими данными не найден.',
                'welcome' => 'Добро пожаловать, :username!'
            ],
            'logout' => [
                'success' => 'Вы вышли из аккаунта.'
            ],
            'password' => [
                'forgot' => [
                    'success' => 'На вашу почту отправлено письмо с инструкциями по сбросу пароля.',
                    'user_not_found' => 'Пользователь с таким адресом электронной почты не найден.'
                ],
                'reset' => [
                    'invalid_code' => 'Код сброса пароля не существует или устарел.'
                ]
            ],
            'activation' => [
                'success' => 'Ваш аккаунт успешно активирован!',
                'fail' => 'Код активации недействителен или устарел.',
                'already' => 'Этот аккаунт уже подтвержден.'
            ]
        ],
        'shop' => [
            'catalog' => [
                'put_in_cart' => 'Товар добавлен в корзину.'
            ],
            'cart' => [
                'remove' => [
                    'success' => 'Товар убран из корзины.',
                    'fail' => 'Неудалось убрать товар из корзины.'
                ]
            ]
        ]
    ],
    'admin' => [
        'items' => [
            'add' => [
                'success' => 'Предмет успешно создан.'
            ],
            'edit' => [
                'success' => 'Предмет успешно отредактирован.',
                'not_found' => 'Редактирование не удалось: предмет не существует.'
            ],
            'list' => [
                'delete' => [
                    'success' => 'Предмет был удалён.',
                    'not_found' => 'Неудалось удалить: предмет не существует.'
                ]
            ]
        ]
    ],
    'request_error' => [
        'title' => 'Во время выполнения запроса произошла ошибка.',
        'notify' => 'Рекомендуем сообщить об этом администрации ресурса.',
        'main' => 'На главную',
        'back' => 'Назад',
    ],
    'only_for_auth' => 'Для того, чтобы получить доступ к странице вы должны авторизоваться.'
];
